[
  {
    "url": "https://en.wikipedia.org/wiki/History_of_India",
    "paragraph": "According to consensus in modern genetics, anatomically modern humans first arrived on the Indian subcontinent from Africa between 73,000 and 55,000 years ago.[1]  However, the earliest known human remains in South Asia date to 30,000 years ago.  Settled life, which involves the transition from foraging to farming and pastoralism, began in South Asia around 7,000 BCE.  At the site of Mehrgarh presence can be documented of the domestication of wheat and barley, rapidly followed by that of goats, sheep, and cattle.[2] By 4,500 BCE, settled life had spread more widely,[2] and began to gradually evolve into the Indus Valley Civilization, an early civilization of the Old world, which was contemporaneous with Ancient Egypt and Mesopotamia. This civilisation flourished between 2,500 BCE and 1900 BCE in what today is Pakistan and north-western India, and was noted for its urban planning, baked brick houses, elaborate drainage, and water supply.[3]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_last_survivors_of_historical_events",
    "paragraph": "A historical event can be defined as any occurrence from the past regardless of significance, with the term \"history\" an umbrella term relating to past events and any associated memories, discoveries, collections, organizations, presentations, and/or interpretations of them. This differs from a historic event which is often less inclusive, and stands out as having made a significant impact on history itself.[1]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_television_shows_based_on_Indian_history",
    "paragraph": "\nThis is a list of notable television shows based on subjects of Indian history. Some shows listed below are fictionalised or dramatised shows based on historical events and people.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Rebellion_of_1857",
    "paragraph": "The Indian Rebellion of 1857 was a major uprising in India in 1857–58 against the rule of the British East India Company, which functioned as a sovereign power on behalf of the British Crown.[6][7] The rebellion began on 10 May 1857 in the form of a mutiny of sepoys of the Company's army in the garrison town of Meerut, 40 mi (64 km) northeast of Delhi. It then erupted into other mutinies and civilian rebellions chiefly in the upper Gangetic plain and central India,[a][8][b][9] though incidents of revolt also occurred farther north and east.[c][10] The rebellion posed a considerable threat to British power in that region,[d][11] and was contained only with the rebels' defeat in Gwalior on 20 June 1858.[12] On 1 November 1858, the British granted amnesty to all rebels not involved in murder, though they did not declare the hostilities to have formally ended until 8 July 1859. Its name is contested, and it is variously described as the Sepoy Mutiny, the Indian Mutiny, the Great Rebellion, the Revolt of 1857, the Indian Insurrection, and the First War of Independence.[e][13]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_reservation",
    "paragraph": "An Indian reservation is an area of land held and governed by a federally recognised Native American tribal nation which government is accountable to the U.S. Bureau of Indian Affairs and not to the state government in which it is located. Some of the country's 574[3] federally recognized tribes govern more than one \nof the 326[1] Indian reservations in the United States, while some share reservations, and others have no reservation at all. Historical piecemeal land allocations under the Dawes Act facilitated sales to non–Native Americans, resulting in some reservations becoming severely fragmented, with pieces of tribal and privately held land being treated as separate enclaves. This jumble of private and public real estate creates significant administrative, political and legal difficulties.[4]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Historical_reenactment",
    "paragraph": "Historical reenactment (or re-enactment) is an educational or entertainment activity in which mainly amateur hobbyists and history enthusiasts put on uniforms and follow a plan to recreate aspects of a historical event or period. This may be as narrow as a specific moment from a battle, such as the reenactment of Pickett's Charge presented during the Great Reunion of 1913, or as broad as an entire period, such as Regency reenactment. \n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Rocks_Beach,_Florida",
    "paragraph": "Indian Rocks Beach, or IRB, is a city in Pinellas County, Florida, United States. The population was 4,286 at the 2018 census.[4] Indian Rocks Beach is part of the Tampa-St. Petersburg-Clearwater, FL Metropolitan Statistical Area. Located on the barrier island Sand Key, it has over two miles of beach along the Gulf of Mexico, with 26 public beach accesses.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_films_based_on_actual_events_(2000%E2%80%93present)",
    "paragraph": "This is a list of films and miniseries that are based on actual events. All films on this list are from American production unless indicated otherwise.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_historical_films_set_in_Near_Eastern_and_Western_civilization",
    "paragraph": "\nThe historical drama or period drama is a film genre in which stories are based upon historical events and famous people. Some historical dramas are docudramas, which attempt an accurate portrayal of a historical event or biography, to the degree that the available historical research will allow. Other historical dramas are fictionalized tales that are based on an actual person and their deeds, such as Braveheart, which is loosely based on the 13th-century knight William Wallace's fight for Scotland's independence.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Parmanu:_The_Story_of_Pokhran",
    "paragraph": "Parmanu: The Story of Pokhran (transl. Atom; Hindi pronunciation: [pəɾmaːɳʊ]) is a 2018 Indian Hindi language historical drama film directed by Abhishek Sharma and jointly written by Saiwyn Quadras, Sanyuktha Chawla Sheikh and Sharma.[3] It was produced by Zee Studios, JA Entertainment and KYTA Productions banners. The film is based on the nuclear bomb test explosions conducted by the Indian Army at Pokhran in 1998.[4][5] It stars John Abraham, Diana Penty and Boman Irani in lead roles.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Anglo-Indian_people",
    "paragraph": "Anglo-Indian people fall into two different groups: those with mixed Indian and British ancestry, and people of British descent born or residing in India. The latter sense is now mainly historical,[5][6] but confusions can arise. The Oxford English Dictionary, for example, gives three possibilities: \"Of mixed British and Indian parentage, of Indian descent but born or living in Britain or (chiefly historical) of English descent or birth but living or having lived long in India\".[7] People fitting the middle definition are more usually known as British Asian or British Indian. This article focuses primarily on the modern definition, a distinct minority community of mixed Eurasian ancestry, whose first language is English. According to the Indian government , one is considered an Anglo-Indian if he or she has an British ancestor in paternal line. As the term Euro-Indians would be confused with Indo-Europeans, the group now also includes Hispano-Indians, those who have a Portuguese ancestor in paternal line, therefore the Anglo-Indians can have  either an Iberian or a British surname. The early wave of Greek settlers after Alexanders' conquest are wholly assimilated, so there are no Greek-Indians anymore.  \n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Historical_fiction",
    "paragraph": "Historical fiction is a literary genre in which the plot takes place in a setting related to the past events, but is fictional. Although the term is commonly used as a synonym for the historical romance, it can also be applied to other types of narrative, including theatre, opera, cinema, and television, as well as video games and graphic novels.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_cuisine",
    "paragraph": "Historical events such as invasions, trade relations, and colonialism have played a role in introducing certain foods to this country. The Columbian discovery of the New World brought a number of new vegetables and fruit to India. A number of these such as potatoes, tomatoes, chillies, peanuts, and guava have become staples in many regions of India.[3]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/21_Sarfarosh_-_Saragarhi_1897",
    "paragraph": "21 Sarfarosh - Saragarhi 1897 is an Indian historical drama television series starring Mohit Raina, Prakhar Shukla and Mukul Dev. The show is based on the Battle of Saragarhi, fought between Sikh soldiers of the British Indian Army and Pashtun Orakzai tribesmen. Produced by Contiloe Entertainment, it ran from 12 February to 11 May 2018, on Discovery Jeet.[1][2][3][4]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Flag_of_India",
    "paragraph": "The National Flag of India (Hindi: Tiraṅgā) is a horizontal rectangular tricolour of India saffron, white and India green; with the Ashoka Chakra, a 24-spoke wheel, in navy blue at its centre. It was adopted in its present form during a meeting of the Constituent Assembly held on 22 July 1947, and it became the official flag of the Dominion of India on 15 August 1947. The flag was subsequently retained as that of the Republic of India. In India, the term \"tricolour\" almost always refers to the Indian national flag. The flag is based on the Swaraj flag, a flag of the Indian National Congress designed by Pingali Venkayya.[N 1]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_Indian_massacres_in_North_America",
    "paragraph": "In the history of the European colonization of the Americas, an Indian massacre is any incident between European settlers and indigenous peoples wherein one group killed a significant number of the other group outside the confines of mutual combat in war.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/American_Indian_Wars",
    "paragraph": "The American Indian Wars, also known as the American Frontier Wars, the First Nations Wars in Canada (French: Guerres des Premières Nations), and the Indian Wars, were fought by European governments and colonists in North America, and later by the United States and Canadian governments and American and Canadian settlers, against various American Indian and First Nation tribes. These conflicts occurred in North America from the time of the earliest colonial settlements in the 17th century until the early 20th century. The various wars resulted from a wide variety of factors. The European powers and their colonies also enlisted allied Indian tribes to help them conduct warfare against each other's colonial settlements. After the American Revolution, many conflicts were local to specific states or regions and frequently involved disputes over land use; some entailed cycles of violent reprisal.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Historical_revisionism",
    "paragraph": "In historiography, historical revisionism is the re-interpretation of a historical account.[1] It usually involves challenging the orthodox (established, accepted or traditional) views held by professional scholars about a historical event or time-span or phenomenon, introducing contrary evidence, or reinterpreting the motivations and decisions of the people involved. The revision of the historical record can reflect new discoveries of fact, evidence, and interpretation, which then results in revised history. In dramatic cases, revisionism involves a reversal of older moral judgments.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_films_based_on_actual_events",
    "paragraph": "This is a list of films and miniseries that are based on actual events. All films on this list are from American production unless indicated otherwise.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Historical_trauma",
    "paragraph": "Historical trauma (HT), as used by social workers, historians, and psychologists, refers to the cumulative emotional harm of an individual or generation caused by a traumatic experience or event. Historical Trauma Response (HTR) refers to the manifestation of emotions and actions that stem from this perceived trauma.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Anti-Indian_sentiment",
    "paragraph": "Anti-Indian sentiment refers to negative feelings and hatred towards the Republic of India, Indian people, and Indian culture.[1] Indophobia is formally defined in the context of anti-Indian prejudice as \"a tendency to react negatively towards people of Indian extraction against aspects of Indian culture and normative habits\".[2]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Non-resident_Indian_and_person_of_Indian_origin",
    "paragraph": "Overseas Indians, officially known as Non-Resident Indians (NRIs) or Persons of Indian Origin (PIOs), are people of Indian birth or ancestry who live outside the Republic of India. According to a Ministry of External Affairs report, there are 32 million NRIs and PIOs residing outside India and overseas Indians comprise world's largest overseas diaspora.[1] Every year 2.5 million (25 lakhs) Indians migrate overseas, which is the highest annual number of migrants in the world.[8]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Kesari_(2019_film)",
    "paragraph": "Kesari (transl. Saffron) is a 2019 Indian Hindi-language war film[3] written and directed by Anurag Singh. It was jointly produced by Aruna Bhatia, Karan Johar, Hiroo Yash Johar, Apoorva Mehta, and Sunir Khetarpal under the banners of Dharma Productions, Cape of Good Films, Azure Entertainment, and Zee Studios. The film stars Akshay Kumar with Parineeti Chopra in a special appearance, Vikram Singh Chauhan, Sarwar, Vansh Bhardwaj, Jaspreet Singh, Vivek Saini, Vikram Kochhar, and Rakesh Sharma in supporting roles. It follows the events leading to the Battle of Saragarhi, a battle between 21 soldiers of the 36th Sikhs of the British Indian Army and 10,000 Afridi and Orakzai Pashtun tribesmen in 1897.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Armed_Forces",
    "paragraph": "The Indian Armed Forces are the military forces of the Republic of India. It consists of three professional uniformed services: the Indian Army, Indian Navy, and Indian Air Force.[12] Additionally, the Indian Armed Forces are supported by the Central Armed Police Forces,[13] Assam Rifles, Indian Coast Guard and Special Frontier Force and various inter-service commands and institutions such as the Strategic Forces Command, the Andaman and Nicobar Command and the Integrated Defence Staff. The President of India is the Supreme Commander of the Indian Armed Forces. The Indian Armed Forces are under the management of the Ministry of Defence (MoD) of the Government of India. With strength of over 1.4 million active personnel,[14][15] it is the world's second-largest military force and has the world's largest volunteer army.[16] It also has the third-largest defence budget in the world.[17] As per 2015 Credit Suisse report, the Indian Armed Forces is the world's fifth-most powerful military,[18] whereas the 2020 GlobalFirepower report lists it as the fourth most-powerful military.[19]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Accounting_Standards",
    "paragraph": "Indian Accounting Standard (abbreviated as Ind-AS) is the Accounting standard adopted by companies in India and issued under the supervision of Accounting Standards Board (ASB) which was constituted as a body in the year 1977. ASB is a committee under Institute of Chartered Accountants of India (ICAI) which consists of representatives from government department, academicians, other professional bodies viz. ICAI, representatives from ASSOCHAM, CII, FICCI, etc. ICAI is an independent body formed under an act of parliament.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_equipment_of_the_Indian_Army",
    "paragraph": "Future Ready Combat Vehicle (FRCV)- up to 1770 in number to replace the T-72 MBT. The tanks would have 120/125mm smooth bore gun, be in medium weight class (50 tonnes) with a crew of 3/4 personnel.[67][195]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_people",
    "paragraph": "Indians are the nationals and citizens of India, the second most populous nation in the world, containing 17.50% of the world's population. In India, the term \"Indian\" refers to nationality, rather than a particular ethnicity or language; the Indian nationality consists of dozens of regional ethno-linguistic groups, reflecting the rich and complex history of the region. Due to emigration, the Indian diaspora is present throughout the world, notably in other parts of Asia, North America, Europe, the Caribbean, Oceania, and Africa.[4] The demonym Indian applies to nationals of the present-day Republic of India, but also to people residing outside of India, who are called Overseas Indians; before the partition of India in 1947, the demonym applied to all nationals residing in the entirety of British India (including what is now Pakistan and Bangladesh).[25][26]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Viceroy%27s_House_(film)",
    "paragraph": "Viceroy's House is a 2017 British-Indian fictional historical drama film directed by Gurinder Chadha and written by Paul Mayeda Berges, Moira Buffini, and Chadha.[4] The film stars Hugh Bonneville, Gillian Anderson, Manish Dayal, Huma Qureshi, and Michael Gambon.[5] It was selected to be screened out of competition at the 67th Berlin International Film Festival.[6]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Veerapandiya_Kattabomman_(film)",
    "paragraph": "Veerapandiya Kattabomman (transl. Kattabomman, the Brave Warrior) is a 1959 Indian Tamil-language biographical war film produced and directed by B. R. Panthulu. The film stars Sivaji Ganesan, Gemini Ganesan, Padmini, S. Varalakshmi, and Ragini, with V. K. Ramasamy and Javar Seetharaman in supporting roles. Its soundtrack and score were composed by G. Ramanathan.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Chittagong_(film)",
    "paragraph": "Chittagong is a 2012 Indian historical war drama film directed by Bedabrata Pain.[9][10][11] It stars Manoj Bajpayee in the lead role and is based upon events of British India's Chittagong Uprising.[12][13] The film features music by trio Shankar–Ehsaan–Loy and sound by Resul Pookutty.[14] The world premier of film was on 10 April 2012.[15] Chittagong released on 12 October 2012 and nett grossed Rs 3.1 million at the  Indian box office. This movie won the 60th National Film Awards for the Best Debut Film of a Director.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Ocean",
    "paragraph": "The Indian Ocean is the third-largest of the world's five oceanic divisions, covering 70,560,000 km2 (27,240,000 sq mi) or 19.8% of the water on Earth's surface.[5] It is bounded by Asia to the north, Africa to the west and Australia to the east. To the south it is bounded by the Southern Ocean or Antarctica, depending on the definition in use.[6] Along its core, the Indian Ocean has some large marginal or regional seas such as the Arabian Sea, the Laccadive Sea, the Somali Sea, Bay of Bengal, and the Andaman Sea.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Shunga_Empire",
    "paragraph": "The Shunga Empire (IAST: Śuṅga) was an ancient Indian dynasty from Magadha that controlled areas of the central and eastern Indian subcontinent from around 184 to 75 BCE. The dynasty was established by Pushyamitra Shunga, after taking the throne of the Maurya Empire. Its capital was Pataliputra, but later emperors such as Bhagabhadra also held court at Besnagar (modern Vidisha) in eastern Malwa.[1]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/All_India_Anglo-Indian_Association",
    "paragraph": "The All India Anglo-Indian Association is an organisation representing the interests of Anglo-Indians. It was founded in 1926 in colonial India by Sir Henry Gidney.[1][2] It has sixty-two branches in all of India.[3]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/National_Film_Awards",
    "paragraph": "Jogwa (2008)\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Sino-Indian_War",
    "paragraph": "Indian sources:[13][14]1,383 killed1,696 missing548–1,047 wounded3,968 captured\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/The_Empire_(TV_series)",
    "paragraph": "The Empire is an Indian historical fiction period drama streaming television series created by Nikkhil Advani and directed by Mitakshara Kumar based on the novel series Empire of the Moghul by Alex Rutherford for Disney+ Hotstar.[1][2] The series was premiered on Disney+ Hotstar on 27 August 2021.[3]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_independence_movement",
    "paragraph": "The Indian independence movement was a series of historic events with the ultimate aim of ending British rule in India. It lasted from 1857 to 1947.[1]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Tanhaji",
    "paragraph": "Tanhaji: The Unsung Warrior is a 2020 Indian Hindi-language historical action film, co-written and directed by Om Raut and produced by Bhushan Kumar, Krishan Kumar and Ajay Devgn under T-Series Films and Ajay Devgn FFilms. Tracing the life of Maratha warrior Tanaji Malusare, it stars Ajay Devgn in titular role, in addition to Saif Ali Khan and Kajol in important supporting roles, it also features Neha Sharma, Sharad Kelkar and Luke Kenny in other supporting roles.[4] Set in the 17th century, it revolves around Tanaji's attempts to recapture the Kondhana fortress once it passes on to Mughal emperor Aurangzeb who transfers its control to his trusted Rajput guard Udaybhan Singh Rathore.The film was originally named Taanaji: The Unsung Warrior but the name was later changed to Tanhaji; The Unsung Warrior for numerological reasons.[5][6]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Timeline_of_Indian_history",
    "paragraph": "Evidence for presence of Hominins with Acheulean technology 1,500,000–100,000 BCE in Tamil Nadu.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Americans",
    "paragraph": "Indian Americans or Indo-Americans are citizens of the United States with ancestry from India. The United States Census Bureau uses the term Asian Indian to avoid confusion with Native Americans. With a population of almost four million, Indian Americans make up 1.2% of the U.S. population and are the largest group of South Asian Americans, as well as the second largest group[7] of Asian Americans after Chinese Americans.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/British_Raj",
    "paragraph": "The British Raj (/rɑːdʒ/; from Hindi rāj: kingdom, realm, state, or empire.[2][a]) was the rule of the British Crown on the Indian subcontinent from 1858 to 1947.[4][5][6][7] The rule is also called Crown rule in India,[8] or direct rule in India.[9] The region under British control was commonly called India in contemporaneous usage and included areas directly administered by the United Kingdom, which were collectively called British India, and areas ruled by indigenous rulers, but under British paramountcy, called the princely states. The region was sometimes called the Indian Empire, though not officially.[10]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Gajakesari",
    "paragraph": "Gajakesari is a 2014 Indian Kannada-language historical action film directed by cinematographer Krishna and produced by Jayanna and Bogendra. The film stars Yash in leading role along with Amulya and Anant Nag. The film also prominently features an elephant named Arjuna from Waynad, Kerala.[1] Actor Prakash Raj plays as narrator for the film to introduce Yash's character. Also uncredited writer Sai Prasad did the still photography and concept design for the making of the movie. This film is also dubbed in Hindi as Gajakeasari:The Big Lion.[2]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Television_Academy_Awards",
    "paragraph": "The Indian Television Academy Awards, also known as the ITA Awards, is an annual event organised by the Indian Television Academy to honour excellence of Indian Television.[1]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Mangal_Pandey:_The_Rising",
    "paragraph": "Mangal Pandey: The Rising (internationally known as The Rising: Ballad of Mangal Pandey) is a 2005 Indian historical biographical drama film based on the life of Mangal Pandey, an Indian soldier known for helping to spark the Indian rebellion of 1857 (also known as The First War of Indian Independence).\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Kappalottiya_Thamizhan",
    "paragraph": "Kappalottiya Thamizhar (transl. The Tamilian who launched a ship) is a 1961 Indian Tamil-language historical drama film produced and directed by B. R. Panthulu. The film stars Sivaji Ganesan, Gemini Ganesan and Savitri. It is based on the 1944 book of the same name by M. P. Sivagnanam, a biography of V. O. Chidambaram Pillai who founded the Swadeshi Stream Navigation Company to break the monopoly of the British over maritime trade out of India.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_rupee",
    "paragraph": "The Indian rupee (symbol: ₹; code: INR) is the official currency of India. The rupee is subdivided into 100 paise (singular: paisa), though as of 2019, coins of denomination of 1 rupee is the lowest value in use. The issuance of the currency is controlled by the Reserve Bank of India. The Reserve Bank manages currency in India and derives its role in currency management on the basis of the Reserve Bank of India Act, 1934.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/American_Indian_boarding_schools",
    "paragraph": "American Indian boarding schools, also known more recently as American Indian Residential Schools, were established in the United States from the mid 17th to the early 20th centuries with a primary objective of \"civilizing\" or assimilating Native American children and youth into Euro-American culture. In the process, these schools denigrated Native American culture and made children give up their languages and religion.[1] At the same time the schools provided a basic Western education. These boarding schools were first established by Christian missionaries of various denominations. The missionaries were often approved by the federal government to start both missions and schools on reservations,[2] especially in the lightly populated areas of the West. In the late 19th and early 20th centuries especially, the government paid religious orders to provide basic education to Native American children on reservations, and later established its own schools on reservations. The Bureau of Indian Affairs (BIA) also founded additional off-reservation boarding schools based on the assimilation model. These sometimes drew children from a variety of tribes. In addition, religious orders established off-reservation schools.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_National_Congress",
    "paragraph": "The Indian National Congress (abbr. INC), colloquially the Congress Party but often simply Congress, is a political party in India with widespread roots.[23] Founded in 1885, it was the first modern nationalist movement to emerge in the British Empire in Asia and Africa.[a][24] From the late 19th century, and especially after 1920, under the leadership of Mahatma Gandhi, Congress became the principal leader of the Indian independence movement.[25] Congress led India to independence from the United Kingdom,[d] and powerfully influenced other anti-colonial nationalist movements in the British Empire.[e][24] Due to its enduring history, the Congress is often called the \"grand old party\".\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Matchmaking",
    "paragraph": "Indian Matchmaking is a 2020 Indian documentary television series produced by Smriti Mundhra that premiered on Netflix on July 16, 2020.[1][2][3] In August 2021, Netflix renewed the series for a second season.[4]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/French_and_Indian_War",
    "paragraph": "The French and Indian War (1754–1763) was a theater of the Seven Years' War, which pitted the North American colonies of the British Empire against those of the French, each side being supported by various Native American tribes. At the start of the war, the French colonies had a population of roughly 60,000 settlers, compared with 2 million in the British colonies.[4] The outnumbered French particularly depended on the natives.[5]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Raag_Desh_(film)",
    "paragraph": "Raag Desh (transl. Love the country) is a 2017 Indian historical action drama film directed by Tigmanshu Dhulia and produced by Gurdeep Singh Sappal and Rajya Sabha TV.[3][4][5] The film is based on Indian National Army trials, the joint court martial of  Indian National Army officers Colonel Prem Sahgal, Colonel Gurbaksh Singh Dhillon, Major Shah Nawaz Khan.[6] The leading roles in Raag Desh have been played by Kunal Kapoor, Amit Sadh, Mohit Marwah and Mrudula Murali.[7] The film was released on July 28, 2017.[8][1] Rishi Punjabi is the cinematographer of the film.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/2015_in_British_television",
    "paragraph": "The entire series of Call the Midwife was successful in the ratings this year, with all eight episodes from its fourth series reaching the Top 20 most watched programmes watched in 2015. Successful drama broadcasts on BBC One continued with EastEnders Live Week surrounding the Who Killed Lucy Beale? storyline. The Voice UK also enjoyed its most successful series ever, with the first six episodes reaching the Top 50.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Native_Americans_in_the_United_States",
    "paragraph": "Native Americans, also known as American Indians, First Americans, Indigenous Americans and other terms, are the Indigenous peoples of the United States; sometimes including Hawaii and territories of the United States, and other times limited to the mainland. There are 574 federally recognized tribes living within the US, about half of which are associated with Indian reservations. \"Native Americans\" (as defined by the United States Census) are Indigenous tribes that are originally from the contiguous United States, along with Alaska Natives.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Mughal-e-Azam",
    "paragraph": "Mughal-e-Azam (transl. The Great Mughal) is a 1960 Indian epic historical drama film directed by K. Asif and produced by Shapoorji Pallonji. Starring Prithviraj Kapoor, Madhubala, Durga Khote and Dilip Kumar, it follows the love affair between Mughal Prince Salim (who went on to become Emperor Jahangir) and Anarkali, a court dancer. Salim's father, Emperor Akbar, disapproves of the relationship, which leads to a war between father and son.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Culture_of_India",
    "paragraph": "Indian culture is the heritage of social norms, ethical values, traditional customs, belief systems, political systems, artifacts and technologies that originated in or are associated with the ethno-linguistically diverse Indian subcontinent. The term also applies beyond India to countries and cultures whose histories are strongly connected to India by immigration, colonization, or influence, particularly in South Asia and Southeast Asia. India's languages, religions, dance, music, architecture, food and customs differ from place to place within the country.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Origins_of_the_Sino-Indian_War",
    "paragraph": "A long series of events triggered the Sino-Indian War in 1962. According to John W. Garver, Chinese perceptions about the Indian designs for Tibet, and the failure to demarcate a common border between China and India (including the Indian Forward Policy)[1][2] were important in China's decision to fight a war with India.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Historical_negationism",
    "paragraph": "\nHistorical negationism,[1][2] also called denialism, is falsification[3][4] or distortion of the historical record. It should not be conflated with historical revisionism, a broader term that extends to newly evidenced, fairly reasoned academic reinterpretations of history.[5] In attempting to revise the past, illegitimate historical revisionism may use techniques inadmissible in proper historical discourse, such as presenting known forged documents as genuine, inventing ingenious but implausible reasons for distrusting genuine documents, attributing conclusions to books and sources that report the opposite, manipulating statistical series to support the given point of view, and deliberately mistranslating texts.[6]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Airlift_(film)",
    "paragraph": "Airlift is a 2016 Indian Hindi-language historical drama film directed by Raja Krishna Menon starring Akshay Kumar and Nimrat Kaur, that follows Ranjit Katyal (played by Kumar), a Kuwait-based businessman as he carries out the evacuation of Indians based in Kuwait during the Invasion of Kuwait by Saddam Hussein's Iraq.[1] The film was jointly produced by Abundantia Entertainment, Cape of Good Films, Emmay Entertainment, Hari Om Entertainment, T-Series and Viacom 18 Motion Pictures on a total budget of ₹320 million.[4] The plot is adapted from real life story of a Kuwait-based Malayali businessman Mathunny Mathews.[5]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Ocean_Dipole",
    "paragraph": "The Indian Ocean Dipole (IOD), also known as the Indian Niño, is an irregular oscillation of sea surface temperatures in which the western Indian Ocean becomes alternately warmer (positive phase) and then colder (negative phase) than the eastern part of the ocean.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_historical_films_set_in_Asia",
    "paragraph": "Historical or period drama is a film genre in which stories are based on historical events and famous persons. Some historical dramas attempt to accurately portray a historical event or biography, to the degree that the available historical research will allow. Other historical dramas are fictionalised tales that are based on an actual person and their deeds.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Tamil_historical_novels",
    "paragraph": "Prathaapa Mudaliaar Charithram (\"The Life of Prathaapa Mudaliaar\"), written in 1857 and published in 1879, was the first novel in the Tamil language. The novel does not involve historical characters or events but is set in royal times.  Penned by Maayuram Vedanaayakam Pillai, it was a landmark in Tamil literature, which had hitherto seen writings only in poetry. The book gave birth to a new literary genre and Tamil prose began to be recognized as an increasingly important part of the language. One can see the style of any Tamil author in this novel.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Historical_Roasts",
    "paragraph": "Historical Roasts is an American comedy television series on Netflix. Based on the Los Angeles live comedy show of the same name,[1] the series \"roasts\" historical figures including Abraham Lincoln, Martin Luther King Jr., and Cleopatra.[2] The 6-episode first season was released on Netflix on May 27, 2019. It is hosted by Jeff Ross, a \"recurring roaster\" who has appeared frequently in stand-up specials and series on Comedy Central.[3][4][5]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Coins_of_the_Indian_rupee",
    "paragraph": "Coins of the Indian rupee (INR) were first minted in 1950.[1] New coins have been produced annually since then and they make up a valuable aspect of the Indian currency system. Today, circulating coins exist in denominations of One Rupee, Two Rupees, Five Rupees, Ten Rupees and Twenty Rupees. All of these are produced by four mints located across India,[2] in Kolkata, Mumbai, Hyderabad, Noida.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India",
    "paragraph": "The prime minister of India (IAST: Bhārat ke Pradhānamantrī), officially the prime minister of the Republic of India is the head of the executive branch of the government of India. The prime minister is the presiding member of the Council of Ministers of the central government and heads the federal cabinet. They can be a member of any of the two houses of the Parliament of India—the Lok Sabha (House of the People) and the Rajya Sabha (Council of the States); but has to be a member of the political party or coalition, having a majority in the Lok Sabha.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Multi-sport_event",
    "paragraph": "A multi-sport event is an organized sporting event, often held over multiple days, featuring competition in many different sports among organized teams of athletes from (mostly) nation-states. The first major, modern, multi-sport event of international significance was the  Olympic Games, first held in modern times in 1896 in Athens, Greece and inspired by the Ancient Olympic Games, one of a number of such events held in antiquity. Most modern multi-sports events have the same basic structure. Games are held over the \ncourse of several days in and around a \"host city\", which changes for each competition. Countries send national teams to each competition, consisting of individual athletes and teams that compete in a wide variety of sports.  Athletes or teams are awarded gold, silver or bronze medals for first, second and third place respectively. Each games are generally held every four years, though some are annual competitions.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Lists_of_21st-century_earthquakes",
    "paragraph": "The following is a summary of significant earthquakes during the 21st century.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_National_Army",
    "paragraph": "The Indian National Army (INA; Azad Hind Fauj /ˈɑːzɑːð ˈhinð ˈfɔːdʒ/; lit. 'Free Indian Army') was an armed force formed by Indian freedom fighters/collaborators and Imperial Japan on 1 September 1942 in Southeast Asia during World War II. Its aim was to secure Indian independence from British rule. It fought alongside Japanese soldiers in the latter's campaign in the Southeast Asian theatre of WWII.[1] The army was first formed in 1942 under Captain Mohan Singh by Indian PoWs of the British-Indian Army captured by Japan in the Malayan campaign and at Singapore.[2] This first INA,which had been handed over to Rash Behari Bose, collapsed and was disbanded in December that year after differences between the INA leadership and the Japanese military over its role in Japan's war in Asia. Rash Behari Bose handed over INA to Subhas Chandra Bose.[3] It was revived under the leadership of Subhas Chandra Bose after his arrival in Southeast Asia in 1943. The army was declared to be the army of Bose's Arzi Hukumat-e-Azad Hind (the Provisional Government of Free India).[4] Netaji Subhas Chandra Bose named the brigades/regiments of INA after Gandhi, Nehru, Maulana Azad, and himself.[5] There was also an all-women regiment named after Rani of Jhanshi, Lakshmibai. Under Bose's leadership, the INA drew ex-prisoners and thousands of civilian volunteers from the Indian expatriate population in Malaya (present-day Malaysia) and Burma.[6] This second INA fought along with the Imperial Japanese Army against the British and Commonwealth forces in the campaigns in Burma: at Imphal and Kohima, and later against the Allied retaking of Burma.[7][8]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_programmes_broadcast_by_Colors_TV",
    "paragraph": "The following is the list of current, upcoming and former television shows broadcast by the Indian television channel Colors TV.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Islam_in_India",
    "paragraph": "Islam is the second-largest religion in India,[5] with 14.9% of the country's population, approximately 195 million people identifying as adherents of Islam in 2015.[1][6] India is the country with the second or third largest number of Muslims in the world.[1][7] The majority of Indian Muslims belong to the Sunni sect of Islam, while the Shia form a sizeable minority.[citation needed] Islam existed in Indian communities along the Arab coastal trade routes in Gujarat, and Malabar as soon as the religion originated and had gained early acceptance in the Arabian Peninsula. \n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Carlisle_Indian_Industrial_School",
    "paragraph": "The United States Indian Industrial School in Carlisle, Pennsylvania, generally known as Carlisle Indian Industrial School, was the flagship Indian boarding school in the United States from 1879 through 1918. It took over the historic Carlisle Barracks, which was transferred to the Department of Interior from the War Department. After the United States entry into World War I, the school was closed and this property was transferred back to the Department of Defense. All the property is now part of the U.S. Army War College.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Independence_Day_(India)",
    "paragraph": "Independence Day is celebrated annually on 15 August as a national holiday in India commemorating the nation's independence from the United Kingdom on 15 August 1947, the day when the provisions of the 1947 Indian Independence Act, which transferred legislative sovereignty to the Indian Constituent Assembly, came into effect. India retained King George VI as head of state until its transition to a republic, when the nation adopted the Constitution of India on 26 January 1950 (celebrated as Indian Republic Day) and replaced the dominion prefix, Dominion of India, with the enactment of the sovereign law Constitution of India. India attained independence following the Independence Movement noted for largely non-violent resistance and civil disobedience.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/American_Association_of_Physicians_of_Indian_Origin",
    "paragraph": "The association is based in Chicago and was founded in 1984. As of 2019, it claims a membership of 80,000 physicians.[1]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Canadian_Indian_residential_school_system",
    "paragraph": "In Canada, the Indian residential school system[nb 1] was a network of boarding schools for Indigenous peoples.[nb 2] Attendance was mandatory from 1894 to 1947. The network was funded by the Canadian government's Department of Indian Affairs and administered by Christian churches. The school system was created to isolate Indigenous children from the influence of their own native culture and religion in order to assimilate them into the dominant Canadian culture.[3][4][5]: 42 [6] Over the course of the system's more than hundred-year existence, around 150,000 children were placed in residential schools nationally.[7]: 2–3  By the 1930s about 30 percent of Indigenous children were believed to be attending residential schools.[8] The number of school-related deaths remains unknown due to incomplete records. Estimates range from 3,200 to over 30,000.[9][10][11][12]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Timeline_of_Indian_innovation",
    "paragraph": "The entries in this timeline fall into the following categories: architecture, astronomy, cartography, metallurgy, logic, mathematics, metrology, mineralogy, automobile engineering, information technology, communications, space and polar technology.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/India",
    "paragraph": "India, officially the Republic of India (Hindi: Bhārat Gaṇarājya),[24] is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west;[f] China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand, Myanmar and Indonesia.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/History_TV18",
    "paragraph": "History TV18 (formerly known as The History Channel) is a pan-Indian television channel broadcasting programmes related to historical events, infotainment and persons,[1] owned by a joint venture between A+E Networks, owner of the American History channel, and TV18, an Indian JV media group.[2] It is available in five languages in full HD across the Indian subcontinent.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Territory",
    "paragraph": "The Indian Territory and the Indian Territories are terms that generally described an evolving land area set aside by the United States Government for the relocation of Native Americans who held aboriginal title to their land as a sovereign independent state. In general, the tribes ceded land they occupied in exchange for land grants in 1803. The concept of an Indian Territory was an outcome of the US federal government's 18th- and 19th-century policy of Indian removal. After the American Civil War (1861–1865), the policy of the US government was one of assimilation.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Visa_requirements_for_Indian_citizens",
    "paragraph": "Visa requirements for Indian citizens are administrative entry restrictions by the authorities of other states placed on citizens of India. as of 12 January 2022,[update] Indian citizens had visa-free or visa on arrival access to 60 countries and territories, ranking the Indian passport 83rd in terms of travel freedom according to the Henley Passport Index.[1] With visa free entry to 22 countries and visa on arrival facility to 41 countries India shares 60th rank in Global Passport Power Rank.[2]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Institute_of_Science",
    "paragraph": "The Indian Institute of Science (IISc) is a public, deemed, research university for higher education and research in science, engineering, design, and management. It is located in Bengaluru, in the Indian state of Karnataka. The institute was established in 1909 with active support from Jamsetji Tata and thus is also locally known as the \"Tata Institute\".[5] It is ranked among the most prestigious academic institutions in India[6] and has the highest citation per faculty among all the universities in the world.[7] It was granted the deemed to be university status in 1958 and the Institute of Eminence status in 2018.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Ojibwe",
    "paragraph": "The Ojibwe, Ojibwa, Chippewa, or Saulteaux are an Anishinaabe people in what is currently southern Canada, the northern Midwestern United States, and Northern Plains. \n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Wind_River_Indian_Reservation",
    "paragraph": "The Wind River Indian Reservation, in the west-central portion of the U.S. state of Wyoming,  is shared by two Native American tribes, the Eastern Shoshone and the Northern Arapaho. Roughly 60 mi (97 km) east to west by 50 mi (80 km) north to south, the Indian reservation is located in the Wind River Basin, and includes portions of the Wind River Range, Owl Creek Mountains, and Absaroka Range.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/22_June_1897",
    "paragraph": "22 June 1897 is a 1979 Marathi film co-written by Shankar Nag and Nachiket Patwardhan and directed by the husband and wife team of Jayoo Patwardhan and Nachiket Patwardhan. The duo are also practising architects. It is based on the true life story of the assassination of British Government officers Walter Charles Rand ICS and Lt. Charles Egerton Ayerst by the Chapekar brothers.\nThe film has been included in the book One Hundred Indian Feature Films: An Annotated Filmography, a representative selection from the first Indian talkies to the then-present date (1988). The title of the film is the date of the assassination, 22 June 1897. It won the 1980 Indian Silver Lotus at the National Film Awards in two categories: Best film on National Integration and Art Direction. It also won the 1980 Maharashtra State awards for best film of the year and best director. The film has been included in the selected collection of Indian films and videos in the US Library of Congress. Most of the performers in the film then belonged to Theatre Academy, Pune.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_School_of_Business",
    "paragraph": "The Indian School of Business (ISB) is a private business school established in India in 2001. It has two parallel campuses in India, in Hyderabad (Telangana) and Mohali (Punjab). It offers certificates in various post-graduate management programs.[6] ISB became the 100th Triple Accredited business school in the world (AMBA, EQUIS, AACSB) upon achieving AMBA accreditation on 12 May 2020.[3]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Act",
    "paragraph": "The Indian Act (Loi sur les Indiens, long name An Act to amend and consolidate the laws respecting Indians)[1] is a Canadian act of Parliament that concerns registered Indians, their bands, and the system of Indian reserves.[2][3] First passed in 1876 and still in force with amendments, it is the primary document that defines how the Government of Canada interacts with the 614 First Nation bands in Canada and their members. Throughout its long history, the act has been a subject of controversy and has been interpreted in different ways by both Indigenous Canadians and non-Indigenous Canadians. The legislation has been amended many times, including \"over five major changes\" made in 2002.[4]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/British_Indians",
    "paragraph": "British Indians  are citizens of the United Kingdom (UK) whose ancestral roots are from India. This includes people born in the UK who are of Indian origin as well as Indians who have migrated to the UK. Today, Indians comprise about 1.4 million people in the UK, making them the single largest visible ethnic minority population in the country. They make up the largest subgroup of British Asians and are one of the largest Indian communities in the Indian diaspora, mainly due to the Indian–British relations (including historical links such as India having been part of the British Empire and still being part of the Commonwealth of Nations). The British Indian community is the sixth largest in the Indian diaspora, behind the Indian communities in the United States, Saudi Arabia, the United Arab Emirates, Malaysia and Nepal. The majority of British Indians are of Punjabi and Gujarati descent, with smaller communities of Tamilian, Bengali, Malayali, Konkani, Marathi and Telugu communities.[2]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Border_(1997_film)",
    "paragraph": "Border is a 1997 Indian Hindi-language epic war film directed, produced and written by J. P. Dutta. Set during the Indo-Pakistani War of 1971, it is an adaptation of real life events that happened during the Battle of Longewala in 1971.[2] The film stars an ensemble cast of Sunny Deol, Sunil Shetty, Akshaye Khanna, Jackie Shroff, Sudesh Berry, Puneet Issar and Kulbhushan Kharbanda. Tabu, Raakhee, Pooja Bhatt and Sharbani Mukherjee feature in supporting roles.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Economy_of_India",
    "paragraph": "The economy of India is a middle income developing mixed economy.[51] It is the world's sixth-largest economy by nominal GDP and the third-largest by purchasing power parity (PPP).[52] According to the International Monetary Fund (IMF), on a per capita income basis, India ranked 145th by GDP (nominal) and 122th by GDP (PPP).[53] From independence in 1947 until 1991, successive governments promoted protectionist economic policies, with extensive state intervention and economic regulation. This is characterised as dirigism, in the form of the License Raj.[54][55] The end of the Cold War and an acute balance of payments crisis in 1991 led to the adoption of a broad economic liberalisation in India.[56][57] Since the start of the 21st century, annual average GDP growth has been 6% to 7%,[51] and from 2013 to 2018, India was the world's fastest growing major economy, surpassing China.[58][59] Historically, India was the largest economy in the world for most of the two millennia from the 1st until the 19th century.[60][61][62]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Historiography",
    "paragraph": "Historiography is the study of the methods of historians in developing history as an academic discipline, and by extension is any body of historical work on a particular subject. The historiography of a specific topic covers how historians have studied that topic using particular sources, techniques, and theoretical approaches. Scholars discuss historiography by topic—such as the historiography of the United Kingdom, that of WWII, the British Empire, early Islam, and China—and different approaches and genres, such as political history and social history. Beginning in the nineteenth century, with the development of academic history, there developed a body of historiographic literature. The extent to which historians are influenced by their own groups and loyalties—such as to their nation state—remains a debated question.[1][2]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Winter_Olympic_Games",
    "paragraph": "The Winter Olympic Games (French: Jeux olympiques d'hiver)[nb 1] is a major international multi-sport event held once every four years for sports practiced on snow and ice. The first Winter Olympic Games, the 1924 Winter Olympics, were held in Chamonix, France. The modern Olympic Games were inspired by the ancient Olympic Games, which were held in Olympia, Greece, from the 8th century BC to the 4th century AD. Baron Pierre de Coubertin founded the International Olympic Committee (IOC) in 1894, leading to the first modern Summer Olympic Games in Athens, Greece in 1896. The IOC is the governing body of the Olympic Movement, with the Olympic Charter defining its structure and authority.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Plains_Indians",
    "paragraph": "Plains Indians or Indigenous peoples of the Great Plains and Canadian Prairies are the Native American tribes and First Nation band governments who have historically lived on the Interior Plains (the Great Plains and Canadian Prairies) of North America. While hunting-farming cultures have lived on the Great Plains for centuries prior to European contact, the region is known for the horse cultures that flourished from the 17th century through the late 19th century. Their historic nomadism and armed resistance to domination by the government and military forces of Canada and the United States have made the Plains Indian culture groups an archetype in literature and art for Native Americans everywhere.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/American_Indian_Movement",
    "paragraph": "The American Indian Movement (AIM) is a Native American grassroots movement founded in July 1968 in Minneapolis, Minnesota,[1] initially centered in urban areas to address systemic issues of poverty, discrimination, and police brutality against Native Americans.[2] AIM soon widened its focus from urban issues to include many Indigenous Tribal issues that Native American groups have faced due to settler colonialism of the Americas. These have included treaty rights, high rates of unemployment, Native American education, cultural continuity, and preservation of Indigenous cultures.[2][3]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/2004_Indian_Ocean_earthquake_and_tsunami",
    "paragraph": "The 2004 Indian Ocean earthquake and tsunami (also known as the Boxing Day Tsunami and, by the scientific community, the Sumatra–Andaman earthquake[10][11]) occurred at 07:58:53 local time (UTC+7) on 26 December, with an epicentre off the west coast of northern Sumatra, Indonesia. It was an undersea megathrust earthquake that registered a magnitude of 9.1–9.3 Mw, reaching a Mercalli intensity up to IX in certain areas. The earthquake was caused by a rupture along the fault between the Burmese Plate and the Indian Plate.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Gautama_Buddha",
    "paragraph": "Gautama Buddha, popularly known as the Buddha (also known as Siddhattha Gotama or Siddhārtha Gautama[note 3] or Shakyamuni), was an ascetic, a religious leader and teacher who lived in ancient India (c. 6th to 5th century BCE or c. 5th to 4th century BCE).[6][7][8][note 4] He is regarded as the founder of the world religion of Buddhism, and revered by Buddhists as an enlightened being,[9] who rediscovered an ancient path to freedom from ignorance, craving and the cycle of rebirth and suffering. He taught for around 45 years and built a large following, both monastic and lay.[10] His teaching is based on his insight into the arising of suffering or dissatisfaction and its ending—the state called Nirvana (lit. vanishing or extinguishing).\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/News",
    "paragraph": "News is information about current events. This may be provided through many different media: word of mouth, printing, postal systems, broadcasting, electronic communication, or through the testimony of observers and witnesses to events. News is sometimes called \"hard news\" to differentiate it from soft media.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Plate",
    "paragraph": "The Indian Plate or India Plate is a minor tectonic plate straddling the Equator in the Eastern Hemisphere. Originally a part of the ancient continent of Gondwana, India broke away from the other fragments of Gondwana 100 million years ago and began moving north.[2] Once fused with the adjacent Australian Plate to form a single Indo-Australian Plate, recent studies suggest that India and Australia have been separate plates for at least 3 million years and likely longer.[3]  The Indian Plate includes most of South Asia—i.e. the Indian subcontinent—and a portion of the basin under the Indian Ocean, including parts of South China and western Indonesia,[4][5] and extending up to but not including Ladakh, Kohistan and Balochistan.[6][7][8]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Partition_of_India",
    "paragraph": "The partition of India was the division of British India[c] in 1947 into two independent Dominions: India and Pakistan.[6] The Dominion of India is today the Republic of India, and the Dominion of Pakistan is the Islamic Republic of Pakistan and the People's Republic of Bangladesh. The partition involved the division of two provinces, Bengal and Punjab, based on district-wide non-Muslim or Muslim majorities. The partition also saw the division of the British Indian Army, the Royal Indian Navy, the Royal Indian Air Force, the Indian Civil Service, the railways, and the central treasury. The partition was outlined in the Indian Independence Act 1947 and resulted in the dissolution of the British Raj, i.e. Crown rule in India. The two self-governing independent Dominions of India and Pakistan legally came into existence at midnight on 15 August 1947.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/The_Forgotten_Army_-_Azaadi_Ke_Liye",
    "paragraph": "The Forgotten Army – Azaadi Ke Liye is a streaming television series which premiered on Amazon Prime Video on 24 January 2020. The series is directed by Kabir Khan, and is based on true events about the men and women in the Indian National Army (INA) led by Subhash Chandra Bose.[2] The series stars Sunny Kaushal and Sharvari.[3] Kabir Khan made his directorial debut with a documentary titled The Forgotten Army in 1999 which was aired by Doordarshan; and during a promotional talk, Kabir Khan said the current series is a project that is 20 years in the making, based on his initial documentary.[4][5] The shooting took place in locations such as Thailand, Singapore, Malaysia and Mumbai.[4]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Malliswari_(1951_film)",
    "paragraph": "Malliswari is a 1951 Indian Telugu-language historical romance film[3] produced and directed by B. N. Reddy under his banner Vauhini Studios. N. T. Rama Rao and P. Bhanumathi  star as a couple – Nagaraju and Malliswari – who are separated by Malliswari's greedy mother. Malliswari is sent to the king's palace according to the custom of \"Rani Vasam\", a tradition during the Vijayanagara Empire wherein young women were fetched to the palace with an offering gold and jewellery to their parents. The rest of the film focuses on the consequences faced by Nagaraju when he, against all rules, surreptitiously enters the palace to meet Malliswari.\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/The_Battle_of_Bhima_Koregaon_(film)",
    "paragraph": "The Battle of Bhima Koregaon is an upcoming Indian Hindi-language period war drama film directed and produced by Ramesh Thete under his banner Ramesh Thete Films.[1] It depicts the events that took place during the Battle of Koregaon. The film stars Arjun Rampal as a Mahar warrior Sidhnak Inamdar, and Digangana Suryavanshi.[2][3]\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Monsoon_of_South_Asia",
    "paragraph": "The monsoon of South Asia is among several geographically distributed global monsoons. It affects the Indian subcontinent, where it is one of the oldest and most anticipated weather phenomena and an economically important pattern every year from June through September, but it is only partly understood and notoriously difficult to predict. Several theories have been proposed to explain the origin, process, strength, variability, distribution, and general vagaries of the monsoon, but understanding and predictability are still evolving.\n"
  }
]
